---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceBecameVertical
source: html/734fb0a9-9c57-1faa-6e7a-4b1eeac2bef7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceBecameVertical Property

Face defining this non-vertical Wall is vertical.

## Syntax (C#)
```csharp
public static FailureDefinitionId FaceBecameVertical { get; }
```